Revit 2024 API
BalusterPlacement Class
 A class which contains information regarding baluster and post placement for a given railing type.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public class BalusterPlacement : IDisposable
Visual Basic
Public Class BalusterPlacement _
	Implements IDisposable
Visual C++
public ref class BalusterPlacement : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Architecture.BalusterPlacement
See Also
BalusterPlacement Members
Autodesk.Revit.DB.Architecture Namespace